#### Terraform Plan 📖
```
module.vercel_test_project.vercel_project.this: Refreshing state... [id=prj_VsXN2Pvews4qhk2AmjwugqwNblAm]
module.worker_test.cloudflare_worker_script.this: Refreshing state... [id=test-worker]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # random_id.vercel_project_suffix will be created
  + resource "random_id" "vercel_project_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.vercel_test_project.vercel_project.this will be updated in-place
  ~ resource "vercel_project" "this" {
      + build_machine_type                                = (known after apply)
      + enable_preview_feedback                           = (known after apply)
        id                                                = "prj_VsXN2Pvews4qhk2AmjwugqwNblAm"
      ~ name                                              = "vercel-test-project" -> (known after apply)
      ~ oidc_token_config                                 = {
          ~ issuer_mode = "global" -> "team"
        }
      + preview_comments                                  = (known after apply)
      + protection_bypass_for_automation_secret           = (sensitive value)
      ~ resource_config                                   = {
          ~ fluid                     = true -> (known after apply)
          + function_default_cpu_type = (known after apply)
          ~ function_default_regions  = [
              - "iad1",
            ] -> (known after apply)
          + function_default_timeout  = (known after apply)
        } -> (known after apply)
      ~ serverless_function_region                        = "iad1" -> (known after apply)
        # (14 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Deprecated Resource

  with module.worker_test.cloudflare_worker_script.this,
  on modules/cloudflare_worker/main.tf line 1, in resource "cloudflare_worker_script" "this":
   1: resource "cloudflare_worker_script" "this" {

`cloudflare_worker_script` is now deprecated and will be removed in the next
major version. Use `cloudflare_workers_script` instead.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
_Pusheado por: @alexanderovie_